{
  "backend/main.mo": "Defines backend actor with authorization mixins, typed models, and CRUD maps for profiles, clients, orders, entries, assets, documents, and APK download info.",
  "feature_evidence.json": "Feature evidence report mapping APK download and admin update features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose across pages, hooks, components, and utilities.",
  "frontend/index.css": "Global Tailwind-based theme variables for light and dark modes using OKLCH color tokens and base styling.",
  "frontend/index.html": "Minimal HTML document bootstrapping the React app by loading main.tsx into the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authorization gating, profile setup flow, and top-level layout and route definitions.",
  "frontend/src/components/accounts/DailyEntryForm.tsx": "Form dialog for adding income or expense entries with validation, payment mode selection, and backend submission.",
  "frontend/src/components/assets/AssetForm.tsx": "Form dialog for creating a new asset, handling validation and submit via useAddAsset.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a login button for unauthorized users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity authentication and handles states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter their name and save their profile.",
  "frontend/src/components/clients/ClientForm.tsx": "Form dialog to add a new client with validation and submission via useAddClient.",
  "frontend/src/components/common/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for deletions with loading state support.",
  "frontend/src/components/documents/DocumentsSyncStatus.tsx": "Shows document sync status, including online/offline state, pending/failed operations, and retry options.",
  "frontend/src/components/documents/DocumentsTable.tsx": "Renders a documents table with download and delete actions, including dialogs and size/date formatting.",
  "frontend/src/components/documents/DocumentUploadCard.tsx": "Card for uploading PDF/Word/Excel files with validation, progress tracking, and onUpload callback.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with navigation, header, footer, and user info display.",
  "frontend/src/components/orders/OrderForm.tsx": "Provides a form for creating a new order with validation, mutation submission, and dialog UI.",
  "frontend/src/components/settings/AllowlistManager.tsx": "Manages assigning user roles by principal ID with validation and confirmation dialog.",
  "frontend/src/components/settings/ApkDownloadSection.tsx": "Displays APK download info with health checks, admin editing capabilities, and URL validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useApkDownloadInfo.ts": "Fetches and updates APK download info using actor methods with validation and cache updates.",
  "frontend/src/hooks/useApkLinkHealthCheck.ts": "Provides a React Query hook to check APK link health using HEAD and no-CORS fallbacks with timeout handling.",
  "frontend/src/hooks/useAuthorization.ts": "Fetches user role, profile, and admin status via actor and exposes authorization state.",
  "frontend/src/hooks/useDocumentsOfflineQueue.ts": "Manages an offline queue for document upload/delete operations with localStorage persistence and retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity loading via AuthClient.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on clients, orders, daily entries, and documents using the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and base styles.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountsPage.tsx": "Accounts page rendering daily entries with filtering, add/delete actions, and authorization-based controls.",
  "frontend/src/pages/AssetsPage.tsx": "Displays a list of assets with add and delete actions, handling authorization and deletion confirmation.",
  "frontend/src/pages/ClientDetailPage.tsx": "Shows detailed client info and their filtered orders, with options to add or delete orders.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, add, and delete functionality, including navigation to client details.",
  "frontend/src/pages/DashboardPage.tsx": "Calculates and displays income, expenses, and balances in KPI cards and a monthly summary.",
  "frontend/src/pages/DocumentsPage.tsx": "Manages documents with upload, delete, caching, and offline queue syncing.",
  "frontend/src/pages/SettingsPage.tsx": "Displays user profile and admin settings, including allowlist management and APK download options.",
  "frontend/src/utils/dates.ts": "Provides helpers for getting start-of-day/month timestamps, checking if dates match today or this month, and formatting dates.",
  "frontend/src/utils/documentsCache.ts": "Implements localStorage caching for document metadata with get, set, and clear operations.",
  "frontend/src/utils/errors.ts": "Normalizes unknown errors into user-friendly message strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/src/utils/validateHttpUrl.ts": "Validates HTTP/HTTPS URLs and returns structured success or error results.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining themes, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata file describing project state, features, known issues, architecture, and requirements."
}