{
  "backend/main.mo": "Main backend actor managing authorization, user profiles, clients, and basic CRUD operations with sorting utilities.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding empty documents map and initializing nextDocumentId.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests involved in implementing documents module and offline sync.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including routing, hooks, UI components, and documents-related code.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens for light and dark themes with shared component styling.",
  "frontend/index.html": "Basic HTML entrypoint loading the React application via main.tsx.",
  "frontend/src/App.tsx": "React app entry configuring TanStack Router, authentication gates, layout, and routes including DocumentsPage.",
  "frontend/src/components/accounts/DailyEntryForm.tsx": "Form dialog for adding income or expense entries with validation, input fields, and mutation handling.",
  "frontend/src/components/assets/AssetForm.tsx": "Form dialog for creating an asset with validation and submission via useAddAsset.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with loading and error recovery.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting user to enter their name and save their profile.",
  "frontend/src/components/clients/ClientForm.tsx": "Form dialog for adding a new client with basic validation and submission via useAddClient.",
  "frontend/src/components/documents/DocumentsSyncStatus.tsx": "Displays online/offline sync status, pending/failed operations, and retry controls.",
  "frontend/src/components/documents/DocumentsTable.tsx": "Table listing documents with download/delete actions and formatting for dates and sizes.",
  "frontend/src/components/documents/DocumentUploadCard.tsx": "Card for uploading PDF/Word/Excel files with validation, progress tracking, and metadata submission.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header navigation, user info, login button, and footer, highlighting active routes.",
  "frontend/src/components/orders/OrderForm.tsx": "Implements an order creation dialog with validation, form fields, and submission using the addOrder mutation.",
  "frontend/src/components/settings/AllowlistManager.tsx": "Provides a UI to assign user roles by principal ID with confirmation and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useAuthorization.ts": "Fetches and exposes user role, profile, and admin status using the actor and identity.",
  "frontend/src/hooks/useDocumentsOfflineQueue.ts": "Manages an offline queue for document upload and delete operations with persistence and status control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, storing identity state and exposing login and logout helpers.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks and returns the browser's online/offline status using event listeners.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on clients, orders, daily entries, and assets using an actor-based backend.",
  "frontend/src/index.css": "Sets global Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountsPage.tsx": "Displays daily income and expense entries with filtering and a form to add new entries.",
  "frontend/src/pages/AssetsPage.tsx": "Shows a list of assets and allows adding new assets via a dialog form.",
  "frontend/src/pages/ClientDetailPage.tsx": "Shows detailed client info and their orders with filtering and the ability to add new orders.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients with search and navigation to detail pages, plus a form to add clients.",
  "frontend/src/pages/DashboardPage.tsx": "Displays financial KPIs by calculating daily, monthly, and total income/expenses and rendering cards with loading states.",
  "frontend/src/pages/DocumentsPage.tsx": "Manages documents with online/offline sync, cached display, and queued upload/delete operations.",
  "frontend/src/pages/SettingsPage.tsx": "Shows user profile info and admin-only allowlist management along with app details.",
  "frontend/src/utils/dates.ts": "Provides helpers for detecting today/current month and formatting timestamps.",
  "frontend/src/utils/documentsCache.ts": "Stores and retrieves document metadata in localStorage with safe fallbacks.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL/session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Defines the current project state for an internal Flutter-based Android business management app and lists architecture notes, features, and issues. Serves as a versioned snapshot describing implemented modules and planned behavior."
}