{
  "kind": "build_request",
  "title": "Fix APK download link and ensure fast working download from Settings",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Ensure the Settings → Android App download section provides a working, stable, publicly reachable direct-download APK URL (no 404) so authorized users can download the APK successfully from both laptop and phone.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "yes i want APK download link fast"
        ]
      },
      "acceptanceCriteria": [
        "From Settings → Android App, clicking \"Download APK\" successfully starts a download or opens a direct-download URL in a new tab on both desktop and mobile browsers.",
        "The configured APK URL must not return HTTP 404 when checked from a typical laptop browser network (no authentication required).",
        "If the current configured URL is broken (e.g., 404), admins can update it and the UI reflects the new URL immediately after saving (no manual refresh required)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Keep (or adjust if currently incorrect) the admin update flow for APK download info so an administrator can quickly update APK URL and version label from the Settings page, with clear English validation and error messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "yes i want APK download link fast"
        ]
      },
      "acceptanceCriteria": [
        "Non-admin users cannot see APK edit controls and cannot update APK download information.",
        "Admins can click \"Edit\", enter an HTTPS/HTTP URL and optional version label, click \"Save\", and see a success message in English.",
        "Invalid URLs are rejected with an English error message and no backend update is performed."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Ensure the APK link health check status shown in the Android App section accurately reflects the current configured URL and updates after an admin saves a new URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "yes i want APK download link fast"
        ]
      },
      "acceptanceCriteria": [
        "When an APK URL is present, the UI shows a health status message in English (e.g., \"Link is reachable and working\" or \"Link not found (404)\").",
        "After saving a new APK URL, the health check is re-run against the new URL and the displayed status message updates accordingly.",
        "If no APK URL is configured, the UI shows an English message indicating the APK is not available yet."
      ]
    }
  ],
  "constraints": [
    "Do not edit any frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add/modify migration logic if state shape changes require it.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Implementing a new authentication provider (Internet Identity is already in use).",
    "Adding new distribution providers or third-party hosting integrations for the APK beyond storing and displaying a direct-download URL."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}