{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Documents module (frontend): upload, list, download, delete with offline-first sync",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add a Documents page/route with upload, list, download/view, and delete actions for PDF/Word/Excel files (English UI).",
      "acceptanceCriteria": [
        "A new route exists at \"/documents\" and is reachable from the main navigation in AppLayout.",
        "The Documents page provides an upload form that lets the user select a file and optionally enter a note/description before saving.",
        "The upload UI validates file type to allow only PDF, Word, and Excel documents; disallowed file types show an English error message and are not uploaded.",
        "The page shows a list/table of stored documents with at least: file name, type, upload date/time, and size.",
        "Each document row provides actions to download/view the file (using browser download/open behavior) and delete the document with a confirmation step.",
        "All user-facing labels/messages on the Documents page are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DocumentsPage.tsx",
          "operation": "create",
          "description": "Create the Documents page UI: upload form (file + optional description), validation for PDF/Word/Excel, and a documents table with download/view + delete (with confirmation) actions. Use the blob-storage ExternalBlob capability (e.g., create from bytes for upload; use direct URL for download/open behavior). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/documents/DocumentUploadCard.tsx",
          "operation": "create",
          "description": "Add an encapsulated upload UI card used by DocumentsPage, including file-picker, description field, file-type validation, and upload progress display (English). Use the blob-storage ExternalBlob upload-progress capability (withUploadProgress) to show progress. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/documents/DocumentsTable.tsx",
          "operation": "create",
          "description": "Add a reusable table for document metadata (name, type, uploaded date/time, size) and row actions (download/view, delete with confirmation dialog) wired from DocumentsPage (English labels)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new \"/documents\" route in the TanStack Router tree and wire it to DocumentsPage so it is navigable."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a \"Documents\" navigation item pointing to \"/documents\" in the main nav list (keep existing layout; English label)."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Integrate Documents into the React Query data layer with offline-first caching and queued upload/delete sync plus status indicators and retry.",
      "acceptanceCriteria": [
        "New React Query hooks exist for: listing documents, uploading a document, downloading/fetching a document by id, and deleting a document.",
        "After upload or delete succeeds, the Documents list refreshes automatically (query invalidation consistent with existing patterns in frontend/src/hooks/useQueries.ts).",
        "When offline, the Documents list shows the last cached metadata (if available).",
        "When offline, document upload/delete operations are queued and sync automatically when connectivity returns, reusing the existing offline-first sync status patterns (English status text).",
        "If a queued document operation fails to sync, the UI indicates sync failure and allows retry (consistent with existing offline-first UX patterns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add Documents-focused React Query hooks: list documents (metadata), upload document, fetch document by id for download/view behavior, and delete document. Ensure upload/delete invalidate the documents list query on success (consistent with existing patterns). Use the blob-storage ExternalBlob capability for upload/download data handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOnlineStatus.ts",
          "operation": "create",
          "description": "Create a small hook that exposes browser connectivity state (online/offline) and change events to support offline-first behavior and UI messaging."
        },
        {
          "path": "frontend/src/hooks/useDocumentsOfflineQueue.ts",
          "operation": "create",
          "description": "Implement an offline queue manager for document upload/delete operations: persist queued ops locally, attempt sync when online, track per-op status (pending/syncing/failed/succeeded), and expose retry controls for failed ops (English status text). For uploads, store enough data to replay the upload later (including file bytes representation and metadata). Use blob-storage ExternalBlob for reconstructing uploads when syncing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/documentsCache.ts",
          "operation": "create",
          "description": "Add a lightweight local cache helper for document metadata (read/write) so the list can render last-known metadata while offline (no backend calls)."
        },
        {
          "path": "frontend/src/components/documents/DocumentsSyncStatus.tsx",
          "operation": "create",
          "description": "Create a small status/indicator component for the Documents page showing: offline/online state, queued operation count, last sync error (if any), and a retry action (English)."
        },
        {
          "path": "frontend/src/pages/DocumentsPage.tsx",
          "operation": "modify",
          "description": "Wire the Documents page to use the new React Query hooks and offline queue/cache helpers: show cached metadata when offline, enqueue upload/delete when offline, auto-sync queued ops on reconnect, invalidate/refresh the list after successful sync, and surface sync state via DocumentsSyncStatus (English)."
        }
      ]
    }
  ]
}