{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize APK direct-download link, admin update flow, and accurate link health status in Settings",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Ensure Settings → Android App provides a stable, publicly reachable direct-download APK URL and a reliable download action on desktop and mobile.",
      "acceptanceCriteria": [
        "From Settings → Android App, clicking \"Download APK\" successfully starts a download or opens a direct-download URL in a new tab on both desktop and mobile browsers.",
        "The configured APK URL must not return HTTP 404 when checked from a typical laptop browser network (no authentication required).",
        "If the current configured URL is broken (e.g., 404), admins can update it and the UI reflects the new URL immediately after saving (no manual refresh required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/ApkDownloadSection.tsx",
          "operation": "modify",
          "description": "Harden the download UX to always use the configured direct-download URL first, open in a new tab reliably for mobile/desktop, and present a clearly visible direct link (e.g., \"Open link\") for users to validate reachability. Keep admin-only controls guarded via the authorization component’s isAdmin state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useApkDownloadInfo.ts",
          "operation": "modify",
          "description": "Improve update behavior so saving a new APK URL/version updates the cached apkDownloadInfo immediately (optimistic cache update) and triggers refetch/invalidation so the Settings UI updates without manual refresh. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Maintain a correct admin-only APK update flow in Settings with clear English validation and error messages; prevent non-admin edits.",
      "acceptanceCriteria": [
        "Non-admin users cannot see APK edit controls and cannot update APK download information.",
        "Admins can click \"Edit\", enter an HTTPS/HTTP URL and optional version label, click \"Save\", and see a success message in English.",
        "Invalid URLs are rejected with an English error message and no backend update is performed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/ApkDownloadSection.tsx",
          "operation": "modify",
          "description": "Refine client-side validation to enforce HTTP/HTTPS URLs with English errors, ensure Save is disabled/blocked when invalid, and ensure non-admin users never see edit controls (using authorization component admin state). Also ensure error messages from failed saves are normalized to clear English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useApkDownloadInfo.ts",
          "operation": "modify",
          "description": "Centralize URL validation messaging so invalid URLs throw a clear English error and do not call the backend; ensure authorization failures are surfaced as an English, user-friendly message. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/validateHttpUrl.ts",
          "operation": "create",
          "description": "Add a small shared helper that validates a string as an HTTP/HTTPS URL and returns consistent English error messages for Settings form validation."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Make the APK link health check status accurate for the current configured URL and ensure it updates immediately after an admin saves a new URL.",
      "acceptanceCriteria": [
        "When an APK URL is present, the UI shows a health status message in English (e.g., \"Link is reachable and working\" or \"Link not found (404)\").",
        "After saving a new APK URL, the health check is re-run against the new URL and the displayed status message updates accordingly.",
        "If no APK URL is configured, the UI shows an English message indicating the APK is not available yet."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useApkLinkHealthCheck.ts",
          "operation": "modify",
          "description": "Adjust the health check logic to avoid reporting \"ok\" when CORS prevents reading status; ensure 404 is only reported when definitively detected, otherwise report an English \"could not verify\"/\"unknown\" state. Add a timeout and no-store behavior to keep results current after admin updates. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/settings/ApkDownloadSection.tsx",
          "operation": "modify",
          "description": "Ensure the Android App section always shows an English status when URL is missing (APK not available yet) and displays the current health status tied to the current configured URL. After a successful save, ensure the UI uses the updated URL immediately so the health check re-runs and the message updates without refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useApkDownloadInfo.ts",
          "operation": "modify",
          "description": "Ensure cache invalidation and/or immediate cache update causes the health-check query key (which depends on URL) to update right after saving, triggering a re-check against the new URL. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}